# 下列代码是用于计算WQM的T的N值
import sys
from sympy import *
x = symbols('x')#本案例中N值设置为x。

#-----下面是仪器自己的系数-----
'''
TA0 = 6.643511e-05
TA1 = 2.742823e-04
TA2 = -2.452346e-06
TA3 = 1.531625e-07
'''
#------上面是仪器自己的系数------

#-----下面是各个温度点-----
'''
34.8892
29.9992
24.9242
20.0569
15.0870
9.8717
4.8089
0.8130
'''

#-----上面是各个温度点-----

# ----下面是一个接受用户输入，给4个系数赋值的过程---

TA0,TA1,TA2,TA3 = map(float,input("请依次输入4个参数TA0 TA1 TA2 TA3，每数间一个空格，\n例如：6.643511e-05 2.742823e-04 -2.452346e-06 1.531625e-07\n请输入：>").split())

# 接受一组8个温度点输入。

T1,T2,T3,T4,T5,T6,T7,T8 = map(float,input("请依次输入8个温度点35~0，每数间一个空格，\n例如：34.8892 29.9992 24.9242 20.0569 15.0870 9.8717 4.8089 0.8130\n请输入：>").split())

T = T1,T2,T3,T4,T5,T6,T7,T8 #将数组赋值给T




#-----------下面是利用一个循环依次计算并打出N值-----
print ("----- N值为：------")

for i in range (0,8):
    d = solveset(TA0 + TA1 *x + TA2*(x **2) +TA3 *(x **3) - 1/(273.15+T[i]), x) # 核心计算公式。使用T[i]从T这个数组中按照索引取出数据。
    d1,d2,d3 = d # 将数组d进行切片。
    N = 2.718281825 **d1 #转换出N值
    print (round(N))# "N值为："
