# 本代码是用于计算WQM的电导率N值。

# 下列代码是用于计算WQM的T的N值
import sys
from sympy import *
x = symbols('x')#本案例中N值设置为x。

#-----下面是仪器自己的系数-----

# 将电导率原始系数修改到下面
    G = -1.010158e-00
    H = 1.570058e-01
    II = -3.719996e-04
    J = 5.332862e-05
    WBOTC = -7.2130e-07; # 需手工修改, I项手工再加个I
    hh= 0; # 数值后面加个；行吗？这个是在Matlab里的用法。
    Tcor= 3.250000e-06;        #基本不变


# 接受一组8个C值输入。

C1,C2,C3,C4,C5,C6,C7,C8 = map(float,input("请依次输入8个温度点35~0，每数间一个空格，\n例如：34.8892 29.9992 24.9242 20.0569 15.0870 9.8717 4.8089 0.8130\n请输入：>").split())

C = C1,C2,C3,C4,C5,C6,C7,C8 #将数组赋值给T



'''
#-----------下面是利用一个循环依次计算并打出N值-----
print ("----- N值为：------")

for i in range (0,8):
    d = solveset(TA0 + TA1 *x + TA2*(x **2) +TA3 *(x **3) - 1/(273.15+T[i]), x) # 核心计算公式。使用T[i]从T这个数组中按照索引取出数据。
# p=[TA3 TA2 TA1 (TA0-(1/(273.15+T(i,1))))];
    d1,d2,d3 = d # 将数组d进行切片。
    N = 2.718281825 **d1 #转换出N值
    print (round(N))# "N值为："
'''
# ---- 计算电导率N的核心算法---


for i in range (0,8):
    DDL[i] = C[i]* (1+ Tcor*T[i])# T(i,2)和T(i,1) 啥关系？T(i,2)其实是第二列数据，即电导率(单位s/m)
    #原来代码：C(i,1)=T(i,2)*(1+Tcor*T(i,1)); %解方程前计算
    p = solveset(G + hh *x+ H*(x **2) +II *(x **3)+J*(x **4) - DDL[i], x)
    #p=[J II H hh (G-C(i,1))]; %解方程计算出f
    #result=roots(p);
    #CN(i,1)=result(3,1);
    print (p)
    #N(i,2)=CN(i,1)*1000/sqrt(1+T(i,1)*WBOTC); %由f计算到频率
#end








# 下列代码是使用Matlab进行计算的代码。
'''
% WQM 温度电导率 频率值反推 20171219
clc;clear;

%建立T数组，将8个温度、电导率(单位s/m)八行复制其中 温度第一列电导率第二列
%将温度原始系数修改到下面4行中

%%%%%%%%特别注意强调电导率单位@@@@@@@@@  6.42888S/m

    TA0 = 6.643511e-05
    TA1 = 2.742823e-04
    TA2 = -2.452346e-06
    TA3 = 1.531625e-07
%将电导率原始系数修改到下面
    G = -1.010158e-00
    H = 1.570058e-01
    II = -3.719996e-04
    J = 5.332862e-05
    WBOTC = -7.2130e-07;       %需手工修改   I项手工再加个I
hh= 0;
Tcor= 3.250000e-06;         %基本不变

%计算温度频率
for i=1:8
    p=[TA3 TA2 TA1 (TA0-(1/(273.15+T(i,1))))];
    result=roots(p)
    N(i,1)=2.718281825^result(3,1)
end
%计算电导率频率
for i=1:8
    C(i,1)=T(i,2)*(1+Tcor*T(i,1)); %解方程前计算

    p=[J II H hh (G-C(i,1))]; %解方程计算出f
    result=roots(p);
    CN(i,1)=result(3,1);

    N(i,2)=CN(i,1)*1000/sqrt(1+T(i,1)*WBOTC); %由f计算到频率
end

%数列N中 第一列为温度频率 第二列为电导频率

'''
