#!/usr/bin/python
# -*- coding: utf-8 -*-
# 第27题 ：记住逻辑关系
###书中原文：
''' 这里告诉你一个记住某样东西，而不让自己抓狂的方法:在一整天里，每次记忆一小部分，把你最需要加强的部分标记起来。不要想着在两小时内连续不停地背诵，这不会有什么好的结果。不管你花多长时间，你的大脑也只会留住你在前 15 或者 30 分钟内看过的东西。
取而代之，你需要做的是创建一些索引卡片，卡片有两列内容，正面写下逻辑关系，反面写下答案。你需要做到的结果是:拿出一张卡片来，看到正面的表达式， 例如 “True or False”，你可以立即说出背面的结果是 “True”!坚持练习，直到 你能做到这一点为止。
一旦你能做到这一点了，接下来你需要每天晚上自己在笔记本上写一份真值表出来。不要只是抄写它们，试着默写真值表，如果发现哪里没记住的话，就飞快地撇一眼这里的答案。这样将训练你的大脑让它记住整个真值表。
'''
### 真值表
NOT --------------------- True?

not False---------------True
not True----------------False

-------------------------------------------
OR------------------------True?

True or False-----------True

True or True------------True

False or True----------True

False or False---------False


--------------------------------------------
AND-----------------------True?
True and False---------False
True and True-----------True
False and True----------False
False and False---------False


----------------------------------------
NOT OR---------------------True?

not(True or False)-------False
not(True or True)--------False
not(False or True)-------False
not(False or False)-------True


----------------------------------------
NOT AND--------------------True?

not(True and False)------True
not(True and True)-------False
not(False and True)------True
not(False and False)-----True

-----------------------------------------
!=      ------------------------True?
1!=0 ------------------------True
1!=1-------------------------False
0!=1------------------------True
0!=1------------------------False

------------------------------------------
==        ------------------   True?#在Python中“=”表示赋值；“==”表示相等。
1==0 ------------------False
1==1-------------------True
0==1-------------------False
0==0-------------------True

本书不要求你成功或者失败，只要每天尽力去学，在尽力的基础上，多花一点功夫就可以了。









# 运行后的结果：






