#!/usr/bin/python
# -*- coding: utf-8 -*-
# 第43题 你来制作一个游戏
##作者要求：
'''
你要开始学会自食其力了，那就是你需要的所有的信息网上都有，你只要去搜索就能找到。
以下是你的要求：
1.制作一个截然不同的游戏。
2.使用多个文件，并使用import调用这些文件。
3.对每个房间使用一个class,class的明明要能体现出它的用处。例如GlodRoom,KoiPondRoom.
4.你的执行器代码应该了解这些房间，所以创建一个class来调用并记录这些房间，这里有许多的方法，考虑返回一个房间，或者使用变量来指定下一个房间。

 其他的事情就全靠你了。花一个星期完成这件任务，做一个你能做出来的最好的游戏。使用你学过的任何东西(类，函数，字典，列表......)来改进你的程序。 这节课的目的是教你如何构建 class 出来，而这些class 又能调用到其它 Python 文件中的 class。
我不会详细地告诉你告诉你怎样做，你需要自己完成。试着下手吧，编程就是解决问题的过程，这就意味着你要尝试各种可能性，进行实验，经历失败，然后丢掉你做出来的东西重头开始。当你被某个问题卡住的时候，你可以向别人寻求帮助，并把你的代码贴出来给他们看。如果有人刻薄你，别理他们，你只要集中精力在帮你的人身上就可以了。持续修改和清理你的代码，直到它完整可执行为止， 然后再研究一下看它还能不能被改进。
祝你好运，下个星期你做出游戏后我们再见。
 

'''


# 运行后的结果：
'''
这里我没有单独完成或者写出什么来，下面请继续。

'''


